package ru.ifmo.rain.klepov.i18n;

import java.util.ListResourceBundle;

public class UsageResourceBundle_ru extends ListResourceBundle {

    private static final Object[][] CONTENTS = {
            {"date_min_undef", "Минимум не определен"},
            {"currency_min_undef", "Минимум не определен"},
            {"words_min_undef", "Минимум не определен"},
            {"number_min_undef", "Минимум не определен"},
            {"line_min_undef", "Минимум не определен"},
            {"sentence_min_undef", "Минимум не определен"},

            {"date_max_undef", "Максимум не определен"},
            {"currency_max_undef", "Максимум не определен"},
            {"words_max_undef", "Максимум не определен"},
            {"number_max_undef", "Максимум не определен"},
            {"line_max_undef", "Максимум не определен"},
            {"sentence_max_undef", "Максимум не определен"},

            {"date_avg_undef", "Среднее значение не определено"},
            {"currency_avg_undef", "Среднее значение не определено"},
            {"words_avg_undef", "Среднее значение не определено"},
            {"number_avg_undef", "Среднее значение не определено"},
            {"line_avg_undef", "Среднее значение не определено"},
            {"sentence_avg_undef", "Среднее значение не определено"},

            {"date_avg", "Средняя дата - {0}"},
            {"currency_avg", "Средняя валюта - {0, number, currency}"},
            {"words_avg", "В среднем слова длины {0}"},
            {"number_avg", "Среднее значение по числам {0}"},
            {"line_avg", "Средняя длина строк - {0}"},
            {"sentence_avg", "Средняя длина предложений - {0}"},

            {"date_max", "Максимальная дата (длина={0}): {1, date}"},
            {"currency_max", "Максимальная валюта (длина={0}): {1, number, currency}"},
            {"words_max", "Максимальное слово (длина={0}): {1}"},
            {"number_max", "Максимальное число (длина={0}): {1}"},
            {"line_max", "Самая длинная строка (длина={0}): {1}"},
            {"sentence_max", "Самая длинное предложение (длина={0}): {1}"},

            {"date_min", "Минимальная дата (длина={0}): {1, date}"},
            {"currency_min", "Минимальная валюта (длина={0}): {1, number, currency}"},
            {"words_min", "Минимальное слово (длина={0}): {1}"},
            {"number_min", "Минимальная число (длина={0}): {1}"},
            {"line_min", "Самая короткая строка (длина={0}): {1}"},
            {"sentence_min", "Самое короткое предложение (длина={0}): {1}"},

            {"date_number", "Количество дат: {0} (уникальных: {1})"},
            {"currency_number", "Количество чисел-валют: {0} (уникальных: {1})"},
            {"words_number", "Количество слов: {0} (уникальных: {1})"},
            {"number_number", "Количество чисел: {0} (уникальных: {1})"},
            {"line_number", "Количество строк: {0} (уникальных: {1})"},
            {"sentence_number", "Количество предложений: {0} (уникальных: {1})"},

            {"sentence", "Стстистика по предложениям:"},
            {"date", "Стстистика по датам:"},
            {"currency", "Стстистика по валютам:"},
            {"words", "Стстистика по словам:"},
            {"number", "Стстистика по числам:"},
            {"line", "Стстистика по строкам:"},

            {"common_date", "Количество дат: {0}"},
            {"common_currency", "Количество чисел-валют: {0}"},
            {"common_number", "Количество чисел: {0}"},
            {"common_words", "Количество слов: {0}"},
            {"common_line", "Количество строк: {0}"},
            {"common_sentence", "Количество предложений: {0}"},
            {"common", "Сводная статистика:"},

            {"header", "Анализируемый файл: {0}"},
            {"fileHeader", "Статистика"}
    };

    protected Object[][] getContents() {
        return CONTENTS;
    }
}